# Data extraction

**This project will scrape information about Board Members and Details of a company displayed [`on this page`](https://www.asx.com.au/asx/share-price-research/company/CBA/details)**

First, we have to import `required libraries`. In this project, we will make use of `selenium` and `BeautifulSoup`, which are common packages and libraries used for webscraping

In [1]:
from selenium import webdriver
import chromedriver_binary
from bs4 import BeautifulSoup
import pandas as pd

Next, get the content of the page in `html` format

In [2]:
driver = webdriver.Chrome(executable_path=r'C:\Users\Admin PC\Desktop\Project\chromedriver_win32\chromedriver.exe')

# Get the website
driver.get('https://www.asx.com.au/asx/share-price-research/company/CBA/details')

In [3]:
soup = BeautifulSoup(driver.page_source) # driver.page_source contains the source code of the page in html format

After inspecting the page, we know that the information we want to gain is stored under `table` tag. Therefore, we have to find all the tables and then convert it into `dataframe`

In [4]:
# Find all the tables on page
table = soup.find_all('table')

# Read all tables into dataframe
df = pd.read_html(str(table)) # df is a list of dataframes

Inspect our `df` variable to make sure we captured the right information

In [7]:
# Print all the tables
df

[                            0  \
 0                 Issuer code
 1       Official listing date
 2                 Fiscal year
 3         GICS industry group
 4             Exempt foreign?
 5            Internet address
 6   Registered office address
 7       Head office telephone
 8             Head office fax
 9              Share registry
 10   Share registry telephone

                                                     1
 0                                                 CBA
 1                                          12/09/1991
 2                                                 NaN
 3                                               Banks
 4                                                  No
 5                         http://www.commbank.com.au/
 6   Ground Floor, Tower 1, 201 Sussex Street, SYDN...
 7                                      (02) 9378 2000
 8                                      (02) 9118 7192
 9   LINK MARKET SERVICES LTD  LEVEL 12, 680 GEORGE...
 10                                       1800 022 440  ,
                           0                                 1
 0  Ms Catherine Livingstone      Chairman, Non Exec. Director
 1          Mr Matthew Comyn  Managing Director, CEO, Director
 2           Mr Shirish Apte                Non Exec. Director
 3      Prof. Genevieve Bell                Non Exec. Director
 4          Mr Paul O'Malley                Non Exec. Director
 5           Ms Mary Padbury                Non Exec. Director
 6            Ms Wendy Stops                Non Exec. Director
 7   Ms Anne Templeman-Jones                Non Exec. Director
 8          Mr Rob Whitfield                Non Exec. Director,
                     0                  1
 0  Ms Kristy Huxtable  Company Secretary
 1    Ms Kara Nicholls  Company Secretary]

***We can see that there are 3 dataframes in our list. Let's have a look at each dataframe!***

In [9]:
# First dataframe
df[0]

,0,1
0,Issuer code,CBA
1,Official listing date,12/09/1991
2,Fiscal year,NaN
3,GICS industry group,Banks
4,Exempt foreign?,No
5,Internet address,http://www.commbank.com.au/
6,Registered office address,"Ground Floor, Tower 1, 201 Sussex Street, SYDN..."
7,Head office telephone,(02) 9378 2000
8,Head office fax,(02) 9118 7192
9,Share registry,"LINK MARKET SERVICES LTD LEVEL 12, 680 GEORGE..."
10,Share registry telephone,1800 022 440

In [10]:
# Second dataframe
df[1]

                          0                                 1
0  Ms Catherine Livingstone      Chairman, Non Exec. Director
1          Mr Matthew Comyn  Managing Director, CEO, Director
2           Mr Shirish Apte                Non Exec. Director
3      Prof. Genevieve Bell                Non Exec. Director
4          Mr Paul O'Malley                Non Exec. Director
5           Ms Mary Padbury                Non Exec. Director
6            Ms Wendy Stops                Non Exec. Director
7   Ms Anne Templeman-Jones                Non Exec. Director
8          Mr Rob Whitfield                Non Exec. Director

In [11]:
# Last dataframe in list
df[2]

                    0                  1
0  Ms Kristy Huxtable  Company Secretary
1    Ms Kara Nicholls  Company Secretary

Now that we have all the information we want, the last step is to convert all the `dataframes` into an `excel workbook` with each sheet stores different information about the company

In [13]:
# Export all the tables into excel workbook
with pd.ExcelWriter('Company details.xlsx') as writer:  
    df[0].to_excel(writer, sheet_name='Service_info')
    df[1].to_excel(writer, sheet_name='Board_of_directors')
    df[2].to_excel(writer, sheet_name='Secretaries')

The workbook will be saved in the project directory.
## Thanks for reading!